{"name":"GET - All news","id":"manage-news-admin;get---all-news","testSteps":[{"number":1,"description":"Given I set GET api endpoints all news","duration":27,"startTime":"2023-06-25T16:04:09.279383100+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":2,"description":"I set GET api endpoints all news","duration":0,"startTime":"2023-06-25T16:04:09.302734+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":1}]},{"number":3,"description":"When I send GET HTTP request all news","duration":5224,"startTime":"2023-06-25T16:04:09.309734+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":4,"description":"I send GET HTTP request all news","duration":5218,"startTime":"2023-06-25T16:04:09.312737300+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":1,"children":[{"number":5,"description":"I set GET api endpoints all news","duration":2,"startTime":"2023-06-25T16:04:09.317741500+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":2},{"number":6,"description":"GET https://sociops-backend-production.up.railway.app/news?page\u003d1","duration":0,"startTime":"2023-06-25T16:04:14.530766200+07:00[Asia/Bangkok]","result":"SUCCESS","restQuery":{"method":"GET","path":"https://sociops-backend-production.up.railway.app/news?page\u003d1","content":"","contentType":"null","requestHeaders":"Authorization\u003dBearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjUiLCJuYW1lIjoiUGFrIEpvaG4iLCJyb2xlIjoiQURNSU4iLCJleHAiOjE2ODc3MjY5ODN9.7WfpfZfxsKIkLfL6maSf_3OEpiciuAJMsuNYpUH0i90\r\n\t\t\t\tAccept\u003d*/*","requestCookies":"","responseHeaders":"content-type: application/json; charset\u003dUTF-8\r\nvary: Origin\r\ndate: Sun, 25 Jun 2023 09:04:18 GMT\r\nserver: railway\r\ntransfer-encoding: chunked\r","responseCookies":"\r","responseBody":"{\n    \"data\": [\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 1,\n            \"category_name\": \"Pendidikan\",\n            \"created_at\": \"2023-06-03T00:12:13.532Z\",\n            \"description\": \"Pendidikan merupakan fondasi utama dalam membangun generasi pemimpin yang berkualitas. Dalam era inovasi dan perkembangan teknologi, inovasi dalam pendidikan menjadi kunci untuk mempersiapkan generasi muda menghadapi tantangan masa depan. Pada seminar yang diadakan hari ini, para ahli pendidikan dan pemangku kepentingan terkait berkumpul untuk membahas inovasi dalam pendidikan. Mereka mendiskusikan penerapan teknologi di kelas, pengembangan kurikulum yang relevan, dan metode pembelajaran yang lebih interaktif. Dr. Sarah Johnson, seorang pakar pendidikan terkemuka, menyatakan, \u0027Inovasi dalam pendidikan memungkinkan kita untuk menciptakan lingkungan belajar yang memotivasi dan menantang. Dengan mengintegrasikan teknologi, seperti pembelajaran online dan penggunaan perangkat pintar, kita dapat meningkatkan aksesibilitas dan kualitas pendidikan. Pendidikan STEM (Sains, Teknologi, Rekayasa, dan Matematika) juga menjadi sorotan dalam diskusi tersebut. Para peserta sepakat bahwa pendidikan STEM yang kuat merupakan fondasi penting dalam mengembangkan kemampuan berpikir kritis, kreativitas, dan kemampuan problem solving pada siswa. Selain itu, penting juga untuk memperhatikan inklusi pendidikan, di mana semua anak memiliki kesempatan yang sama untuk belajar dan berkembang. Dengan menyediakan pendidikan yang inklusif dan merangkul keberagaman, kita dapat menciptakan masyarakat yang lebih adil dan berkelanjutan. Sebagai masyarakat, kita perlu mendorong inovasi dalam pendidikan dan bekerja sama dengan pemerintah dan lembaga terkait untuk meningkatkan kualitas pendidikan. Dengan memberikan pendidikan yang berkualitas kepada generasi muda, kita dapat membantu menciptakan masa depan yang cerah dan penuh potensi.\",\n            \"id\": 1,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/33\",\n            \"title\": \"Pemimpin Masa Depan\",\n            \"updated_at\": \"2023-06-03T00:12:13.532Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 2,\n            \"category_name\": \"Lingkungan\",\n            \"created_at\": \"2023-06-07T00:14:35.477Z\",\n            \"description\": \"Lingkungan alam kita menghadapi tantangan serius, termasuk perubahan iklim, kehilangan keanekaragaman hayati, dan polusi. Untuk melindungi dan melestarikan lingkungan, inovasi menjadi kunci dalam membangun solusi yang efektif. Dalam konferensi internasional yang diadakan hari ini, para ahli lingkungan, perwakilan pemerintah, dan komunitas peduli lingkungan berkumpul untuk berbagi penemuan terbaru dan memperkuat upaya konservasi. Mereka membahas tentang penggunaan energi terbarukan, pengurangan limbah plastik, dan restorasi ekosistem. Dr. Maria Hernandez, seorang ahli lingkungan terkemuka, menyampaikan, \u0027Inovasi dalam lingkungan dapat membantu mengurangi dampak negatif yang ditimbulkan oleh aktivitas manusia. Dengan menerapkan teknologi hijau dan mengadopsi praktik ramah lingkungan, kita dapat mencapai keberlanjutan lingkungan untuk masa depan. Pentingnya pendidikan dan kesadaran lingkungan juga menjadi sorotan dalam konferensi ini. Para peserta sepakat bahwa edukasi tentang pentingnya menjaga lingkungan harus dimulai sejak dini di sekolah dan melibatkan komunitas. Dengan meningkatkan pemahaman dan tindakan sadar terhadap lingkungan, kita dapat menciptakan perubahan positif. Selain itu, kolaborasi antara sektor publik dan swasta juga ditekankan. Kerjasama dalam mengembangkan solusi inovatif, seperti teknologi daur ulang dan pengelolaan air yang efisien, dapat membawa dampak yang signifikan dalam menjaga keberlanjutan lingkungan. Sebagai masyarakat, kita memiliki tanggung jawab untuk mendukung inovasi dalam lingkungan dan mengadopsi gaya hidup yang ramah lingkungan. Dengan upaya bersama, kita dapat menjaga keindahan alam dan memberikan warisan yang berkelanjutan kepada generasi mendatang.\",\n            \"id\": 2,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/34\",\n            \"title\": \"Memperkuat Konservasi\",\n            \"updated_at\": \"2023-06-07T00:14:35.477Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 3,\n            \"category_name\": \"Sosial\",\n            \"created_at\": \"2023-06-08T00:15:31.302Z\",\n            \"description\": \"Ketimpangan sosial, kemiskinan, dan masalah sosial lainnya merupakan tantangan yang perlu diatasi dalam membangun masyarakat yang lebih adil dan inklusif. Melalui inovasi sosial, kita dapat menciptakan perubahan positif yang signifikan. Dalam forum inovasi sosial yang diadakan hari ini, para ahli sosial, organisasi non-pemerintah, dan komunitas berbagi gagasan dan praktik terbaik dalam meningkatkan keberdayaan masyarakat. Mereka membahas topik seperti pengembangan ekonomi inklusif, pendidikan keterampilan, dan pemberdayaan perempuan. Dr. Muhammad Rahman, seorang pakar sosial terkemuka, mengungkapkan, \u0027Inovasi sosial berfokus pada menciptakan solusi yang berkelanjutan untuk masalah sosial kompleks. Dengan melibatkan masyarakat dalam perencanaan dan pelaksanaan program, kita dapat membangun keberdayaan dan solidaritas yang memungkinkan kemajuan bersama. Selain itu, teknologi juga memiliki peran penting dalam inovasi sosial. Pemanfaatan teknologi informasi dan komunikasi dapat memperluas akses ke layanan sosial, memfasilitasi pertukaran informasi, dan memobilisasi dukungan untuk perubahan sosial yang lebih baik. Dalam diskusi tersebut, pentingnya kolaborasi antara sektor publik, swasta, dan masyarakat sipil juga ditekankan. Dengan kerjasama yang kuat, kita dapat menciptakan ekosistem inovasi sosial yang memperkuat upaya penanggulangan masalah sosial. Sebagai anggota masyarakat, kita memiliki peran aktif dalam mendukung inovasi sosial. Dengan terlibat dalam kegiatan sosial, memberikan dukungan, dan mengadvokasi perubahan yang lebih baik, kita dapat membantu membangun masyarakat yang inklusif dan adil bagi semua.\",\n            \"id\": 3,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/35\",\n            \"title\": \"Membangun Solidaritas Masyarakat\",\n            \"updated_at\": \"2023-06-08T00:15:31.302Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 4,\n            \"category_name\": \"Anak Sakit\",\n            \"created_at\": \"2023-06-12T00:16:45.792Z\",\n            \"description\": \"Kesehatan anak merupakan prioritas utama dalam membangun masa depan yang lebih baik. Melalui inovasi dalam pelayanan kesehatan anak, kita dapat meningkatkan perawatan medis dan kualitas hidup mereka. Dalam konferensi internasional yang diadakan hari ini, para dokter, ahli kesehatan anak, dan peneliti berkumpul untuk berbagi penemuan terbaru dalam bidang kesehatan anak. Mereka membahas tentang penanganan penyakit kronis, pengembangan terapi baru, dan upaya pencegahan. Dr. Sarah Thompson, seorang ahli pediatri terkemuka, menyampaikan, \u0027Inovasi dalam pelayanan kesehatan anak berperan penting dalam meningkatkan prognosis dan kualitas hidup anak-anak yang sakit. Dengan menerapkan teknologi medis terkini dan pendekatan holistik, kita dapat memberikan perawatan yang terbaik bagi mereka. Pentingnya kolaborasi juga menjadi sorotan dalam konferensi ini. Kolaborasi antara rumah sakit, lembaga penelitian, dan organisasi kesehatan dapat mempercepat pengembangan terapi baru, pertukaran pengetahuan, dan pemahaman yang lebih baik tentang penyakit pada anak. Selain itu, upaya pencegahan dan pendidikan kesehatan juga ditekankan. Dengan mengedukasi orang tua dan masyarakat tentang pentingnya perawatan kesehatan anak, kita dapat mencegah penyakit dan meningkatkan kesadaran akan kesehatan anak secara keseluruhan. Sebagai masyarakat, kita dapat mendukung inovasi dalam pelayanan kesehatan anak dengan memberikan dukungan kepada organisasi dan yayasan yang peduli pada kesehatan anak. Bersama-sama, kita dapat menciptakan lingkungan yang mendukung pertumbuhan dan perkembangan yang sehat bagi anak-anak kita.\",\n            \"id\": 4,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/36\",\n            \"title\": \"Meningkatkan Kualitas Hidup\",\n            \"updated_at\": \"2023-06-12T00:16:45.792Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 5,\n            \"category_name\": \"Kesehatan\",\n            \"created_at\": \"2023-06-15T00:17:32.26Z\",\n            \"description\": \"Kesehatan adalah aspek penting dalam meningkatkan kualitas hidup masyarakat. Melalui inovasi dalam bidang kesehatan, kita dapat mengembangkan solusi yang efektif untuk menangani tantangan kesehatan yang dihadapi oleh masyarakat. Dalam konferensi kesehatan yang diadakan hari ini, para profesional medis, peneliti, dan inovator berkumpul untuk berbagi pengetahuan dan pengalaman mereka dalam memajukan bidang kesehatan. Mereka membahas tentang teknologi medis terbaru, metode pengobatan inovatif, dan pencegahan penyakit. Dr. Maria Hernandez, seorang ahli kesehatan terkemuka, menjelaskan, \u0027Inovasi kesehatan adalah kunci dalam menghadapi permasalahan kesehatan yang kompleks. Dengan penggunaan teknologi mutakhir, pengembangan program pencegahan, dan pendekatan holistik, kita dapat mewujudkan masyarakat yang sehat dan berkualitas. Kolaborasi antara sektor kesehatan, pemerintah, dan industri swasta menjadi hal yang penting dalam konferensi ini. Dengan bersama-sama, mereka dapat memperkuat sistem kesehatan, memperluas akses ke layanan medis, dan meningkatkan kualitas perawatan. Pentingnya pendidikan kesehatan juga ditekankan dalam konferensi ini. Melalui kampanye edukasi dan program sosialisasi, kita dapat meningkatkan kesadaran masyarakat tentang gaya hidup sehat, pentingnya vaksinasi, dan langkah-langkah pencegahan penyakit. Sebagai individu, kita juga memiliki peran dalam mendorong inovasi kesehatan. Dengan mengadopsi gaya hidup sehat, mengikuti anjuran medis, dan mendukung penelitian kesehatan, kita dapat menjadi bagian dari perubahan yang positif dalam masyarakat kita.\",\n            \"id\": 5,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/37\",\n            \"title\": \"Membangun Masyarakat Berkualitas\",\n            \"updated_at\": \"2023-06-15T00:17:32.26Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 6,\n            \"category_name\": \"Infrastuktur\",\n            \"created_at\": \"2023-06-16T00:18:35.103Z\",\n            \"description\": \"Infrastruktur yang kuat dan handal merupakan elemen penting dalam mendukung kemajuan ekonomi dan sosial suatu negara. Melalui inovasi dalam bidang infrastruktur, kita dapat menciptakan sistem yang efisien, berkelanjutan, dan memadai untuk memenuhi kebutuhan masyarakat. Dalam konferensi infrastruktur yang diadakan hari ini, para ahli teknik, perencana, dan pengambil kebijakan berkumpul untuk berdiskusi tentang tren terkini dan teknologi mutakhir dalam pembangunan infrastruktur. Mereka membahas tentang transportasi, energi, air bersih, dan teknologi smart city. Prof. David Evans, seorang pakar infrastruktur terkemuka, menjelaskan, \u0027Inovasi dalam infrastruktur bukan hanya tentang membangun secara fisik, tetapi juga tentang memanfaatkan teknologi dan konsep yang baru. Dengan penerapan smart city dan solusi berkelanjutan, kita dapat menciptakan lingkungan yang lebih efisien dan nyaman bagi masyarakat. Pentingnya kolaborasi antara sektor publik dan swasta juga menjadi sorotan dalam konferensi ini. Dengan kerjasama yang kuat, investasi yang tepat, dan pengelolaan yang baik, kita dapat mempercepat pembangunan infrastruktur dan meningkatkan konektivitas antarwilayah. Selain itu, aspek keberlanjutan juga ditekankan dalam diskusi ini. Dengan memperhatikan faktor lingkungan dan sosial dalam pembangunan infrastruktur, kita dapat mengurangi dampak negatif terhadap lingkungan, memperbaiki kualitas hidup masyarakat, dan mewujudkan pembangunan yang berkelanjutan. Sebagai warga negara, kita juga dapat berperan aktif dalam inovasi infrastruktur. Dengan memberikan masukan konstruktif, mendukung kebijakan progresif, dan memanfaatkan infrastruktur dengan bijak, kita dapat turut serta dalam membangun pondasi yang kokoh bagi kemajuan bangsa kita.\",\n            \"id\": 6,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/38\",\n            \"title\": \"Membangun Pondasi Ekonomi dan Sosial\",\n            \"updated_at\": \"2023-06-16T00:18:35.103Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 7,\n            \"category_name\": \"Seni\",\n            \"created_at\": \"2023-06-18T00:19:26.181Z\",\n            \"description\": \"Seni merupakan ekspresi kreativitas manusia yang memperkaya kehidupan budaya dan memberikan inspirasi kepada masyarakat. Melalui inovasi dalam seni, kita dapat mengembangkan bentuk-bentuk baru, menggabungkan teknologi, dan menciptakan pengalaman yang menakjubkan. Dalam pameran seni yang diadakan hari ini, para seniman, kurator, dan penggemar seni berkumpul untuk mengapresiasi karya-karya terbaru dan berdiskusi tentang perkembangan seni kontemporer. Mereka membahas tentang penggunaan teknologi dalam seni, penggabungan berbagai medium, dan pengaruh seni terhadap masyarakat. Dr. Sophia Lee, seorang kurator terkemuka, menjelaskan, \u0027Inovasi dalam seni memungkinkan kita untuk melihat dunia dengan cara yang baru. Dengan menggabungkan seni tradisional dan teknologi modern, kita dapat menciptakan pengalaman yang memukau dan memperkaya pemahaman kita tentang seni. Kolaborasi juga menjadi kunci dalam pengembangan seni. Kolaborasi antara seniman, institusi seni, dan komunitas dapat menciptakan proyek-proyek kolaboratif yang unik, menghubungkan berbagai perspektif, dan memperluas jangkauan seni ke masyarakat luas. Selain itu, pentingnya pendidikan seni juga ditekankan dalam pameran ini. Dengan memperkenalkan seni kepada generasi muda melalui program pendidikan, kita dapat mengembangkan apresiasi seni, kreativitas, dan kemampuan berpikir inovatif. Sebagai penikmat seni, kita juga dapat memberikan dukungan kepada para seniman dan institusi seni dengan menghadiri pameran, membeli karya seni, dan berpartisipasi dalam kegiatan seni komunitas. Dengan mendukung seni, kita turut berperan dalam memperkaya kehidupan budaya kita.\",\n            \"id\": 7,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/39\",\n            \"title\": \"Memperkaya Kehidupan Budaya\",\n            \"updated_at\": \"2023-06-18T00:19:26.181Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 8,\n            \"category_name\": \"Bencana\",\n            \"created_at\": \"2023-06-19T00:20:44.009Z\",\n            \"description\": \"Bencana alam dan situasi darurat dapat memiliki dampak yang serius bagi masyarakat. Melalui inovasi dalam penanggulangan bencana, kita dapat membangun ketangguhan dan meminimalkan risiko yang terkait dengan bencana. Dalam konferensi penanggulangan bencana yang diadakan hari ini, para ahli bencana, relawan, dan peneliti berkumpul untuk berbagi pengetahuan dan pengalaman mereka dalam menghadapi tantangan bencana. Mereka membahas tentang sistem peringatan dini, teknologi penanggulangan bencana, dan pendekatan partisipatif dalam mitigasi risiko. Dr. Ahmad Yasin, seorang pakar bencana terkemuka, menjelaskan, \u0027Inovasi dalam penanggulangan bencana melibatkan penggunaan teknologi, penguatan kapasitas masyarakat, dan kolaborasi lintas sektor. Dengan langkah-langkah proaktif, kita dapat mengurangi kerugian dan mempercepat pemulihan pasca-bencana. Kerjasama antara pemerintah, lembaga kemanusiaan, dan masyarakat menjadi hal yang penting dalam konferensi ini. Dengan sinergi yang baik, pengelolaan risiko bencana dapat ditingkatkan, respons terhadap bencana dapat diperkuat, dan pemulihan pasca-bencana dapat dilakukan dengan lebih efektif. Pentingnya pendidikan dan kesadaran masyarakat tentang bencana juga ditekankan dalam konferensi ini. Dengan pengetahuan yang tepat, kesiapan darurat, dan partisipasi aktif dalam latihan penanggulangan bencana, masyarakat dapat menjadi lebih tanggap dan bertindak dengan cepat dalam menghadapi bencana. Sebagai individu, kita juga memiliki peran dalam inovasi penanggulangan bencana. Dengan mengikuti pedoman keamanan, mendukung upaya mitigasi risiko, dan menyebarkan informasi yang akurat, kita dapat berkontribusi dalam menciptakan lingkungan yang lebih aman dan tangguh dalam menghadapi bencana.\",\n            \"id\": 8,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/40\",\n            \"title\": \"Membangun Ketangguhan\",\n            \"updated_at\": \"2023-06-19T00:20:44.009Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 9,\n            \"category_name\": \"Panti Asuhan\",\n            \"created_at\": \"2023-06-20T00:21:31.371Z\",\n            \"description\": \"Panti asuhan merupakan tempat perlindungan dan pendidikan bagi anak-anak yang membutuhkan perhatian khusus. Melalui inovasi di panti asuhan, kita dapat memberikan masa depan cerah dan kesempatan yang adil bagi anak-anak yang terlantar. Dalam acara panti asuhan yang diadakan hari ini, para pengelola panti asuhan, donatur, dan relawan berkumpul untuk berbagi pengalaman dan ide dalam meningkatkan kualitas hidup anak-anak di panti asuhan. Mereka membahas tentang pendidikan inklusif, program keterampilan, dan dukungan psikososial bagi anak-anak. Ibu Anita, seorang pengelola panti asuhan yang berpengalaman, menjelaskan, \u0027Inovasi di panti asuhan melibatkan pendekatan holistik dalam memenuhi kebutuhan anak-anak. Kami berfokus pada pendidikan yang berkualitas, perkembangan keterampilan, dan pembentukan ikatan emosional yang sehat dengan anak-anak. Kolaborasi dengan lembaga pendidikan, lembaga swadaya masyarakat, dan sektor bisnis juga menjadi sorotan dalam acara ini. Dengan kerjasama yang baik, panti asuhan dapat menyediakan pendidikan dan pelatihan yang relevan dengan kebutuhan anak-anak serta membantu mereka mengembangkan potensi mereka secara maksimal. Pentingnya partisipasi masyarakat juga ditekankan dalam acara ini. Dengan menjadi donatur, relawan, atau mitra panti asuhan, kita dapat memberikan kontribusi nyata dalam memberikan perlindungan, pendidikan, dan perhatian kepada anak-anak yang membutuhkan. Sebagai masyarakat, kita juga dapat membantu dalam meningkatkan kesadaran tentang isu-isu yang dihadapi oleh anak-anak di panti asuhan. Dengan mengedukasi diri, berbagi informasi yang akurat, dan mendukung kebijakan yang inklusif, kita dapat berperan dalam menciptakan lingkungan yang ramah dan adil bagi anak-anak di panti asuhan.\",\n            \"id\": 9,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/41\",\n            \"title\": \"Masa Depan Cerah untuk Anak-Anak\",\n            \"updated_at\": \"2023-06-20T00:21:31.371Z\"\n        },\n        {\n            \"author\": \"Nailul Izah\",\n            \"category_id\": 10,\n            \"category_name\": \"Disabilitas\",\n            \"created_at\": \"2023-06-21T00:22:10.431Z\",\n            \"description\": \"Penyandang disabilitas adalah bagian penting dari masyarakat yang harus mendapatkan perlakuan yang setara dan inklusif. Melalui inklusi dan inovasi, kita dapat membangun masyarakat yang ramah dan memberikan kesempatan yang adil bagi semua orang. Dalam seminar tentang disabilitas yang diadakan hari ini, para aktivis, ahli, dan penyandang disabilitas berkumpul untuk berbagi pengalaman dan solusi dalam mengatasi tantangan yang dihadapi. Mereka membahas tentang aksesibilitas, teknologi asistif, dan pembangunan inklusif. Bapak Adi, seorang aktivis disabilitas yang inspiratif, menjelaskan, \u0027Inklusi dan inovasi adalah kunci dalam memastikan bahwa semua orang, termasuk penyandang disabilitas, dapat berpartisipasi secara penuh dalam masyarakat. Kita perlu memperhatikan aksesibilitas fisik dan teknologi, serta menciptakan lingkungan yang inklusif dan berempati. Kolaborasi antara pemerintah, sektor swasta, dan organisasi masyarakat juga menjadi fokus dalam seminar ini. Dengan sinergi yang baik, kita dapat merancang kebijakan inklusif, memperluas akses ke layanan yang diperlukan, dan meningkatkan kesadaran tentang hak-hak penyandang disabilitas. Pentingnya pendidikan inklusif dan peluang kerja juga ditekankan dalam seminar ini. Dengan menyediakan pendidikan yang inklusif dan pelatihan keterampilan yang relevan, kita dapat mempersiapkan penyandang disabilitas untuk berpartisipasi dalam dunia kerja dan mengembangkan potensi mereka. Sebagai individu, kita juga dapat berperan dalam menciptakan masyarakat yang inklusif dan ramah terhadap penyandang disabilitas. Dengan meningkatkan kesadaran, menunjukkan empati, dan memberikan dukungan kepada penyandang disabilitas, kita dapat membantu menghilangkan stigma dan membangun lingkungan yang lebih adil dan berempati bagi semua orang.\",\n            \"id\": 10,\n            \"photo_url\": \"https://sociops-backend-production.up.railway.app/asset/42\",\n            \"title\": \"Membangun Masyarakat yang Setara\",\n            \"updated_at\": \"2023-06-21T00:22:10.431Z\"\n        }\n    ],\n    \"message\": \"SUCCESS_GET_ALL_NEWS\",\n    \"status\": true\n}","statusCode":200},"precondition":false,"level":2}]}]},{"number":7,"description":"Then I receive HTTP response code 200 manage news admin","duration":10,"startTime":"2023-06-25T16:04:14.535767700+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":0,"children":[{"number":8,"description":"I receive HTTP response code 200 manage news admin","duration":2,"startTime":"2023-06-25T16:04:14.540297600+07:00[Asia/Bangkok]","result":"SUCCESS","precondition":false,"level":1}]}],"userStory":{"id":"manage-news-admin","storyName":"Manage News Admin","displayName":"Manage News Admin","path":"adminManageNews.feature","narrative":"    As an admin\n    I want to manage news\n    So that I can create and read news  ","type":"feature","qualifiedTag":{"name":"Manage News Admin","type":"feature","displayName":"Manage News Admin"}},"featureTag":{"name":"Manage News Admin","type":"feature","displayName":"Manage News Admin"},"title":"GET - All news","description":"","tags":[{"name":"Windows","type":"context","displayName":"Windows"},{"name":"Manage News Admin","type":"feature","displayName":"Manage News Admin"}],"allTags":[{"name":"Windows","type":"context","displayName":"Windows"},{"name":"Manage News Admin","type":"feature","displayName":"Manage News Admin"}],"startTime":"2023-06-25T16:04:09.266461100+07:00[Asia/Bangkok]","duration":5280,"projectKey":"","isManualTestingUpToDate":false,"context":"windows","manual":false,"testSource":"Cucumber","result":"SUCCESS"}